import {Entity} from './entity.js';

export class Repo{

    static getEntities(arr){
        let entities = [];
        arr.forEach((s, index) => entities.push(new Entity(s, index)));
        return entities;
    }

    static getCards(numberOfCards){
        let syllables = ['ΒΙΟ', 'ΒΕ', 'ΡΑΣ', 'ΡΙ', 'ΓΡΑ', 'ΔΑ', 'ΚΟΙ', 'ΚΕ' , 'ΝΤΕ', 'ΝΟ', 'ΤΡΟ', 'ΤΙ', 'ΣΤΑ', 'ΣΕ', 'ΛΟΣ', 'ΛΙ', 'ΒΟΣ', 
        'ΓΑ', 'ΟΥΣ', 'ΠΑΙ', 'ΘΡΑ', 'ΙΑ', 'ΑΝΟ', 'ΑΔΕ', 'ΡΟ', 'ΡΕΙ', 'ΤΣΙ', 'ΤΟ', 'ΤΥ', 'ΥΣ', 'ΚΟΣ', 'ΚΕΣ', 'ΖΟ', 'ΖΙ', 'ΡΩ', 'ΣΑ', 'ΑΤΙ', 
        'ΑΝΙ', 'ΚΡΥ', 'ΛΑ', 'ΕΡ', 'ΕΛΕ', 'ΨΙ', 'ΧΟ', 'ΚΡΑ', 'ΚΙ', 'ΣΜΑ', 'ΣΥ', 'ΛΩ', 'ΜΑΝ', 'ΕΠΙ', 'ΕΛΑ', 'ΠΛΗ', 'ΠΑΣ', 'ΒΟ', 'ΒΗ', 'ΡΙΑ', 
        'ΡΕ', 'ΑΣΑ', 'ΑΝ', 'ΚΟ', 'ΚΑΣ', 'ΑΠΟ', 'ΚΑΙ', 'ΤΣΑ', 'ΤΙΑ', 'ΓΙ', 'ΓΑΣ', 'ΑΡ', 'ΑΚΟ', 'ΚΟΥ', 'ΚΗ', 'ΠΥ', 'ΡΑ', 'ΙΚΟ', 'ΚΑ', 'ΓΙΑ', 
        'ΓΕ', 'ΚΑΙ', 'ΚΡΙ', 'ΨΩ', 'ΨΑ', 'ΤΡΑ', 'ΤΗ', 'ΕΠΑ', 'ΕΚ', 'ΖΩ', 'ΗΝ', 'ΑΡΟ', 'ΑΜΑ', 'ΣΟ', 'ΣΑΝ', 'ΕΣ', 'ΖΑ', 'ΔΥ', 'ΕΙ', 'ΓΟ', 'ΓΕΙ', 
        'ΠΡΑ', 'ΠΗ', 'ΒΙ', 'ΒΑΣ', 'ΛΙΑ', 'ΛΗ', 'ΙΝΟ', 'ΚΑΝ', 'ΜΟΥ', 'ΝΑ', 'ΔΗ', 'ΔΙΟ', 'ΜΠΑ', 'ΝΕ', 'ΑΡΕ', 'ΑΛΙ', 'ΣΤΙ', 'ΣΙ', 'ΠΟΣ', 'ΠΕΣ', 
        'ΣΤΟ', 'ΣΙΑ', 'ΧΡΗ', 'ΦΟ', 'ΞΟ', 'ΟΛΑ', 'ΦΥ', 'ΦΑ', 'ΜΟ', 'ΜΙ', 'ΤΕ', 'ΤΟΥ', 'ΛΟ', 'ΛΗΣ', 'ΣΩ', 'ΤΑΣ', 'ΝΟΥ', 'ΝΙΑ', 'ΗΡΙ', 'ΘΑ', 'ΓΩ', 
        'ΔΕ', 'ΓΟΥ', 'ΓΗ', 'ΦΩ', 'ΦΙ', 'ΕΡΙ', 'ΕΛΟ', 'ΡΟΣ', 'ΡΗ', 'ΑΣ', 'ΑΜΕ', 'ΜΥ', 'ΝΗ', 'ΞΥ', 'ΟΛΟ', 'ΕΡΑ', 'ΕΛΙ', 'ΔΙΑ', 'ΔΕΣ', 'ΚΥ', 'ΛΕ',
         'ΝΤΙ', 'ΞΑ', 'ΘΥ', 'ΙΚΑ', 'ΜΙΑ', 'ΜΕ', 'ΑΣΕ', 'ΑΝΑ', 'ΑΣΟ', 'ΑΝΕ', 'ΣΤΕ', 'ΣΕΙ', 'ΠΟ', 'ΠΕ', 'ΕΡΟ', 'ΕΝ', 'ΝΩ', 'ΟΙ', 'ΑΠΙ', 'ΑΚΑ',
          'ΠΡΟ', 'ΠΙ', 'ΣΥΝ', 'ΤΑ', 'ΛΥ', 'ΜΑ', 'ΕΞΕ', 'ΕΙΣ', 'ΑΡΑ', 'ΑΛΑ', 'ΠΩ', 'ΡΑΝ', 'ΤΡΙ', 'ΤΗΣ', 'ΣΤΗ', 'ΣΗ', 'ΑΠΕ', 'ΑΙ', 'ΟΣ', 'ΟΡΟ',
           'ΝΤΟ', 'ΞΙ', 'ΑΡΙ', 'ΑΛΟ', 'ΑΤΟ', 'ΒΑ', 'ΑΞΙ', 'ΑΖΙ', 'ΧΩ', 'ΧΑ', 'ΗΣ', 'ΘΕ', 'ΔΟ', 'ΔΙ', 'ΠΙΑ', 'ΠΑΝ', 'ΝΟΣ', 'ΝΙ', 'ΟΥ', 'ΠΑ' ];
        if (!!numberOfCards){
            return this.getEntities(syllables).slice(0, numberOfCards);
        }
        else{
            return this.getEntities(syllables).slice(0, 13);
        }
    }

    static getSides(){
        let sideText = ['Tick', 'Tack', 'Boom'];
        return this.getEntities(sideText);
    }
}